import Image from "next/image";

import PageHeading from "@/app/_components/page-heading";

export default function Functionalities() {
  return (
    <section id="functionalities" className="bg-white">
      <PageHeading tag="h2" text="Каква функционалност включва услугата?" />
      <div className="container mx-auto py-5 md:py-10 grid lg:grid-cols-2 items-center gap-5 max-md:px-5">
        <Image
          src={"/illustrations/functionalities.svg"}
          alt="Изработка на сайт за обяви - функционалности"
          width={600}
          height={400}
          loading="lazy"
          className="mx-auto"
        />
        <div className="text-lg space-y-5 max-lg:text-center">
          <p>
            Услугата включва изработка на уеб сайт за обяви с удобен дизайн и
            много лесно управление. Ще можете да го управлявате, без да имате
            никакви технически умения. Все едно да напишете някаква публикация
            във Facebook, например - да, толкова лесно ще бъде!
          </p>
          <p>
            Някои от ключовите възможности могат да бъдат създаване на нова
            обява, редактиране, изтриване, задаване на валидност в дни или
            месеци, не на последно място управление на статуса на обявата, както
            и много други функции, които са Ви необходими.
          </p>
          <p>
            Възможностите са напълно неограничени, което означава, че можете да
            изберете всякакви функционалности, които Ви идват на ум.
          </p>
          <p>
            Сайтът ще работи бързо и безпроблемно на всякакви устройства –
            компютър, таблет или телефон. Така потребителите Ви ще могат да
            публикуват и разглеждат обяви от всяко място, без значение какво
            устройство използват.
          </p>
          <p>
            Освен това, сайтът ще бъде оптимизиран за търсачките като Google,
            така че да се показва по-напред в резултатите от търсенето. Това
            означава повече трафик, повече посетители и повече клиенти за Вас,
            без да се налага да влагате допълнителни усилия.
          </p>
        </div>
      </div>
    </section>
  );
}
