import Image from "next/image";

import PageHeading from "@/app/_components/page-heading";
import { formatPrice } from "@/lib/utils";

export default function PriceSection() {
  return (
    <section id="price" className="bg-white">
      <PageHeading tag="h2" text="Каква е цената?" />
      <div className="container mx-auto py-5 md:py-10 grid lg:grid-cols-2 items-center gap-5 px-5">
        <div className="text-lg space-y-5 max-md:order-2 max-lg:text-center">
          <p>
            За съжаление, не мога да Ви предложа точна цена предварително, тъй
            като тя зависи изцяло от сложността и изискванията на Вашия проект.
            Възможно е крайната сума да бъде както по-ниска, така и по-висока в
            зависимост от желаните функционалности и ниво на персонализация.
          </p>
          <p>
            Ако се свържете с мен, ще мога да Ви предложа най-добрата възможна
            цена, съобразена с Вашите нужди и бюджет.
          </p>
          <p>
            Работя без използване на готови платформи, създавайки сайтове изцяло
            по индивидуален проект. Това гарантира по-високо качество, гъвкавост
            и оптимизация спрямо Вашите изисквания. Поради този подход, цената
            за изработка на сайт може да бъде в диапацона от {formatPrice(500)}{" "}
            до {formatPrice(10000)} или повече.
          </p>
          <p>
            Плащането може да се направи по банков път еднократно или на етапи в
            зависимост от договорката с клиента.
          </p>
          <p>
            <strong>Договор за изработка</strong>
          </p>
          <p>
            Сключването на писмен договор не е задължително по закон, но е силно
            препоръчително за защита на интересите и на двете страни. Договорът
            осигурява яснота относно обхвата на проекта, сроковете, плащанията и
            правата върху изработения сайт.
          </p>
          <p>
            Ако не желаете формален договор, е важно поне основните условия да
            бъдат уточнени писмено (чрез имейл или чат), за да има яснота и
            сигурност и за двете страни.
          </p>
          <p>
            Ако не желаете формален договор, е добре поне основните условия да
            бъдат уточнени писмено (чрез имейл или чат), за да има яснота и
            сигурност и за двете страни.
          </p>
        </div>
        <Image
          src={"/illustrations/functionalities.svg"}
          alt="Изработка на сайт за обяви - Каква е цената?"
          width={600}
          height={400}
          loading="lazy"
          className="mx-auto max-md:order-1"
        />
      </div>
    </section>
  );
}