import Image from "next/image";

import PageLinkIcon from "@/app/_components/page-link-icon";
import PageHeading from "@/app/_components/page-heading";

export default function Advantages() {
  return (
    <section className="bg-white space-y-10">
      <PageHeading tag={"h2"} text="Предимства на персонализираните сайтове" />
      <div className="lg:px-10 relative z-20">
        <p className="text-lg text-center max-w-3xl mx-auto py-10 px-5 md:p-0">
          В днешно време много хора използват готови платформи като WordPress,
          защото изглеждат лесни за работа. Но често се оказва, че те имат
          ограничения, особено когато става въпрос за скорост, сигурност и
          възможности за развитие. Ако изберете персонализирано решение, ще
          получите сайт, който е напълно съобразен с Вашите нужди – бърз,
          сигурен и лесен за разрастване, когато бизнесът Ви започне да се
          развива.
        </p>
        <div className="container mx-auto px-5 text-lg md:p-0 mt-10">
          <ul className="grid md:grid-cols-2 xl:grid-cols-3 gap-10">
            <DisplayItem
              image="save-money"
              heading="По-ниски дългосрочни разходи"
              content="Да, един персонализиран сайт може да Ви излезе по-солен в началото, но после си избивате парите и спестявате куп главоболия. Няма да се налага постоянно да плащате за платени плъгини, безсмислени ъпдейти или скъп хостинг, който има ненужно мощни сървъри. С нас всичко е направено точно за Вас, без излишни разходи всеки месец. Вместо да наливате пари в абонаменти и допълнителни такси, веднъж инвестирате и после сте спокойни, без да ви цедят постоянно."
            />
            <DisplayItem
              image="rocket-2"
              heading="По-бърза скорост и висока производителност"
              content="Готовите платформи често се влачат, защото разчитат на куп плъгини и тежки теми, които правят сайта бавен като костенурка. 🐢 При персонализиран сайт всичко е писанонаписано точно за Вас – кодът е чист, лек и оптимизиран. Това означава по-бързо зареждане, по-добро изживяване за потребителите и по-висок рейтинг в Google. Никой не обича бавни сайтове, а с добре направен сайт няма да губите посетители, защото страниците Ви ще летят. 🛫"
            />
            <DisplayItem
              image="max-security"
              heading="Максимална сигурност"
              content="Готовите CMS-и са любима мишена за хакери, защото разчитат на единмноготон външни плъгини, които често имат дупки в сигурността. Един персонализиран сайт, обаче, няма тези зависимости – кодът е написан специално за Вас и е много по-труден за пробиване. Това означава по-малък риск от атаки, по-добра защита на данните и никакви излишни притеснения, че сайтът Ви може да падне заради някой бъгав плъгин. С това решение просто спите по-спокойно."
            />
            <DisplayItem
              image="seo"
              heading="По-добра SEO-оптимизация"
              content="Готовите CMS-и може и да са удобни, но често идват с куп външни плъгини, които забавят сайта Ви, влошават скоростта и пречат на доброто класиране в Google. Персонализираният сайт е създаден специално за Вас – оптимизиран, бърз и без излишен код, който да спъва SEO-то. Това означава по-добра видимост, повече посетители и по-високи позиции в търсачките. Няма риск от бавещи плъгини или ненужни зависимости – просто сайт, който работи за Вас и Ви изстрелва напред."
            />
            <DisplayItem
              image="web-design"
              heading="Уникален дизайн и функционалност"
              content="С готовите теми сте ограничени – всичко изглежда еднакво и няма как да избягате от шаблоните. В крайна сметка сайтът Ви ще прилича на още хиляди други, особено ако е безплатен. При персонализирано решение обаче дизайнът е изцяло по Ваш вкус, а функциите са направени точно за Вашите нужди. Няма излишни неща, няма ограничения – всичко е уникално и работи така, както Ви трябва. Това не само Ви отличава от конкуренцията, но и прави сайта по-удобен и ефективен за Вашия бизнес."
            />
            <DisplayItem
              image="expansion"
              heading="Гъвкавост и лесно разширяване"
              content="С готовите CMS-и, ако Ви потрябва нещо ново, често сте зависими от плъгини, които или не вършат работа, или Ви връзват ръцете по всевъзможни начини. При персонализиран сайт, обаче, няма такива ограничения – всичко може да се разширява и надгражда, както Ви е удобно. Искате нова функционалност? Добавяме я без проблем и то бързо, без да чакате някой плъгин да се ъпдейтне или да се молите да има точно това, което Ви трябва. С персонализирано решение имате пълна свобода да развивате сайта, без да зависите от чужд софтуер."
            />
          </ul>
        </div>
      </div>
      <div className="relative text-white bg-black text-lg mt-10 py-10 max-md:px-5 min-h-[300px]">
        <Image
          src={"/illustrations/kriskata-red-background.svg"}
          alt="Изработка на уеб сайтове и уеб приложения"
          fill
          className="absolute top-0 left-0 object-cover z-10"
        />
        <div className="relative z-20">
          <p className="max-w-2xl mx-auto text-center text-xl">
            Персонализираните уеб сайтове са по-бързи, по-сигурни и направени
            точно за това, което Ви трябва – без излишни неща и ограничения.
            Искате сайт, който не само изглежда добре, но и Ви върши работа, без
            да Ви създава главоболия?
          </p>
          <p className="max-w-2xl mx-auto text-center text-2xl mt-5">
            Хайде, да го направим!
          </p>
          <div className="text-center mt-10">
            <PageLinkIcon
              text="Свържете се с мен"
              link="/contacts"
              icon="Phone"
              className="mx-auto"
            />
          </div>
        </div>
      </div>
    </section>
  );
}

type DisplayItemProps = {
  image: string;
  heading: string;
  content: string;
};

function DisplayItem({ image, heading, content }: DisplayItemProps) {
  return (
    <li className="relative border shadow-xl rounded-lg p-5 space-y-5 text-center hover:-translate-y-5 hover:scale-105 duration-300">
      <div className="relative z-20 space-y-5">
        <Image
          src={`/illustrations/${image}.svg`}
          alt="По-ниски дългосрочни разходи"
          width={300}
          height={300}
          priority
          className="w-fit md:w-[300px] md:h-[300px] mx-auto"
        />
        <h2 className="text-2xl font-semibold">{heading}</h2>
        <p>{content}</p>
      </div>
    </li>
  );
}
