import Image from "next/image";

import PageLinkIcon from "@/app/_components/page-link-icon";
import PageHeading from "@/app/_components/page-heading";

export default function Advantages() {
  return (
    <section className="bg-white space-y-10 pb-10">
      <PageHeading tag={"h2"} text="Предимства на персонализираните сайтове" />
      <div className="relative z-20">
        <p className="text-lg text-center max-w-3xl mx-auto py-10 px-5 md:p-0">
          В днешния дигитален свят готовите CMS платформи като WordPress може да
          изглеждат като лесно решение, но те често водят до компромиси в
          скоростта, сигурността и гъвкавостта. С персонализирана разработка
          получавате напълно персонализирано, бързо и мащабируемо решение,
          съобразено с вашите нужди.
        </p>
        <div className="container mx-auto px-5 text-lg md:p-0 mt-10">
          <ul className="grid md:grid-cols-2 xl:grid-cols-3 gap-10">
            <DisplayItem
              image="save-money"
              heading="По-ниски дългосрочни разходи"
              content="Да, един персонализиран сайт може да Ви излезе по-солен в началото, но после си избивате парите и спестявате куп главоболия. Няма да се налага постоянно да плащате за платени плъгини, безсмислени ъпдейти или скъп хостинг, който има ненужно мощни сървъри. С нас Всичко е направено точно за Вас, без излишни разходи всеки месец. Вместо да наливате пари в абонаменти и допълнителни такси, веднъж инвестирате и после сте спокойни, без да ви цедят постоянно."
            />
            <DisplayItem
              image="rocket"
              heading="По-бърза скорост и висока производителност"
              content="Готовите платформи често се влачат, защото разчитат на куп плъгини и тежки теми, които правят сайта бавен като костенурка. 🐢 При персонализиран сайт всичко е писано точно за Вас – кодът е чист, лек и оптимизиран. Това означава по-бързо зареждане, по-добро изживяване за потребителите и по-висок рейтинг в Google. Никой не обича бавни сайтове, а с добре направен сайт няма да губите посетители, защото страниците Ви ще летят. 🛫"
            />
            <DisplayItem
              image="cyber-security"
              heading="Максимална сигурност"
              content="Готовите CMS-и са любима мишена за хакери, защото разчитат на един тон външни плъгини, които често имат дупки в сигурността. Един персонализиран сайт обаче няма тези зависимости – кодът е написан специално за Вас и е много по-труден за пробиване. Това значи по-малък риск от атаки, по-добра защита на данните и никакви излишни притеснения, че сайтът Ви може да падне заради някой бъгав плъгин. С това решение просто спите по-спокойно."
            />
            <DisplayItem
              image="seo"
              heading="По-добра SEO-оптимизация"
              content="Готовите сайтове и теми често бълват излишен код, който не само че забавя сайта, но и прецаква SEO-то. А ако сайтът Ви е бавен и претрупан, Google не го харесва и Ви праща надолу в резултатите. При персонализиран сайт обаче всичко е изчистено и оптимизирано – зарежда бързо, няма излишни боклуци в кода и търсачките го обичат. Това значи по-добро класиране, повече хора, които Ви намират органично, и в крайна сметка – повече посетители без допълнителна реклама."
            />
            <DisplayItem
              image="web-design"
              heading="Уникален дизайн и функционалност"
              content="С готовите теми сте ограничени – всичко изглежда еднакво и няма как да избягате от шаблоните. В крайна сметка сайтът Ви ще прилича на още хиляди други, особено ако е безплатен. При персонализирано решение обаче дизайнът е изцяло по Ваш вкус, а функциите са направени точно за Вашите нужди. Няма излишни неща, няма ограничения – всичко е уникално и работи така, както Ви трябва. Това не само Ви отличава от конкуренцията, но и прави сайта по-удобен и ефективен за Вашия бизнес."
            />
            <DisplayItem
              image="jigsaw"
              heading="Гъвкавост и лесно разширяване"
              content="С готовите CMS-и, ако Ви потрябва нещо ново, често сте зависими от плъгини, които или не вършат работа, или Ви връзват ръцете по всевъзможни начини. При персонализиран сайт обаче няма такива ограничения – всичко може да се разширява и надгражда, както Ви е удобно. Искате нова функционалност? Добавяме го без проблем и то бързо, без да чакате някой плъгин да се ъпдейтне или да се молите да има точно това, което Ви трябва. С персонализирано решение имате пълна свобода да развивате сайта, без да зависите от чужд софтуер."
            />
          </ul>
        </div>
      </div>
      <div className="relative text-white bg-black text-lg mt-10 py-10 max-md:px-5 min-h-[300px]">
        <Image
          src={"/illustrations/Simple Shiny.svg"}
          alt="Изработка на уеб сайтове и уеб приложения"
          fill
          className="absolute top-0 left-0 object-cover z-10"
        />
        <div className="relative z-20">
          <p className="max-w-2xl mx-auto text-center text-xl">
            Персонализираните уеб сайтове са по-бързи, по-сигурни и направени
            точно за това, което Ви трябва – без излишни тъпотии и ограничения.
            Искате сайт, който не само изглежда добре, но и Ви върши работа, без
            да Ви създава главоболия?
          </p>
          <p className="max-w-2xl mx-auto text-center text-2xl mt-5">
            Хайде, да го направим!
          </p>
          <div className="text-center mt-10">
            <PageLinkIcon
              text="Свържете се с мен"
              link="/contacts"
              icon="Phone"
            />
          </div>
        </div>
      </div>
    </section>
  );
}

type DisplayItemProps = {
  image: string;
  heading: string;
  content: string;
};

function DisplayItem({ image, heading, content }: DisplayItemProps) {
  return (
    <li className="relative border shadow-xl rounded-lg p-5 space-y-5 text-center hover:-translate-y-5 hover:scale-105 duration-300">
      <div className="relative z-20 space-y-5">
        <Image
          src={`/illustrations/${image}.png`}
          alt="По-ниски дългосрочни разходи"
          width={200}
          height={200}
          priority
          className="mx-auto"
        />
        <h2 className="text-2xl font-semibold">{heading}</h2>
        <p>{content}</p>
      </div>
    </li>
  );
}
