import PageHeading from "@/app/_components/page-heading";
import Image from "next/image";

export default function Backups() {
  return (
    <section className="bg-white space-y-10 py-10">
      <PageHeading text="Резервни копия на сайта" tag="h2" />
      <div className="container mx-auto lg:px-10 grid lg:grid-cols-2 items-center gap-10">
        <div className="space-y-5 px-5 md:px-0 z-10 max-lg:order-2 max-lg:text-center text-lg">
          <p>
            Резервните копия са не само важни, а и абсолютно необходими за
            защита на Вашия уеб сайт и данни. Аз предлагам услуга за редовно
            архивиране на Вашия сайт, което гарантира, че всички важни файлове,
            бази данни и конфигурации ще бъдат защитени и могат да бъдат
            възстановени лесно, ако се появи проблем. Вие ще можете да се
            отпуснете, знаейки, че данните Ви са в сигурни ръце.
          </p>
          <p className="text-xl font-semibold">Какво правя за Вас?</p>
          <ul className="space-y-1">
            <li className="bg-white shadow-md border rounded py-3 px-5">
              Създавам автоматизирани резервни копия на Вашия сайт – файлове и
              бази данни.
            </li>
            <li className="bg-white shadow-md border rounded py-3 px-5">
              Определям честотата на архивиране в зависимост от нуждите Ви –
              може да бъде ежедневно, седмично или месечно.
            </li>
            <li className="bg-white shadow-md border rounded py-3 px-5">
              Съхранявам резервните копия на сигурни облачни сървъри или на
              отдалечени хранилища, за да осигуря максимална защита.
            </li>
            <li className="bg-white shadow-md border rounded py-3 px-5">
              Възстановявам Вашия сайт бързо и лесно, ако възникне неочакван
              проблем, като срив на сайта или загуба на данни.
            </li>
          </ul>
          <p>
            <strong className="text-xl font-semibold">
              Колко често трябва да се правят резервни копия?
            </strong>
          </p>
          <p>
            Честотата на резервните копия зависи от типа на Вашия сайт. Ако
            сайтът Ви има чести актуализации, като онлайн магазин или блог,
            препоръчвам ежедневни резервни копия. За по-статични сайтове, които
            не се променят често, седмични или месечни архиви ще бъдат напълно
            достатъчни. Аз ще избера най-подходящата стратегия за Вас, за да
            бъдете максимално защитени.
          </p>
          <p>
            <strong className="text-xl font-semibold">
              Какво може да се случи, ако не правите резервни копия?
            </strong>
          </p>
          <p>
            Ако не правите редовни резервни копия, рискувате да загубите важни
            данни, което може да доведе до сериозни проблеми – от загуба на
            информация до прекъсване на услугите на сайта. В случай на атака,
            срив на сървъра или човешка грешка, ако нямате резервно копие,
            възстановяването на сайта може да бъде почти невъзможно. Това може
            да доведе до загуба на репутация и финансови щети.
          </p>
        </div>
        <Image
          src={"/illustrations/backups.svg"}
          alt="Резервни копия на сайта"
          width={900}
          height={600}
          priority
          className="max-lg:order-1 max-lg:max-w-xs mx-auto"
        />
      </div>
    </section>
  );
}
