import PageLinkIcon from "@/app/_components/page-link-icon";
import { formatPrice } from "@/lib/utils";
import Image from "next/image";

export default function PriceAndBudget() {
  return (
    <section className="bg-white space-y-10 pt-10">
      <div className="container mx-auto lg:px-10 grid lg:grid-cols-2 sm:gap-10 items-center">
        <Image
          src={"/illustrations/price-and-budget.svg"}
          alt="Цена и бюджет"
          width={900}
          height={600}
          priority
          className="max-lg:max-w-xs max-lg:mx-auto"
        />
        <div className="text-lg py-10 px-5 md:p-0 space-y-5 max-sm:text-center">
          <h2 className="text-3xl font-semibold">Цена и бюджет</h2>
          <p>
            Цената за изработка на един уеб сайт може да варира в зависимост от
            размера и функционалностите на сайта.
          </p>
          <p>
            Ако имате нужда от малък уеб сайт с до 5 страници, който да Ви служи
            като представяне на Вашия бизнес или услуга, то тогава цената ще е
            от <span>{formatPrice(300)}</span> до{" "}
            <span>{formatPrice(600)}</span>, в зависимост от сложността и размера
            на страниците на сайта.
          </p>
          <p>
            Ако имате нужда от изработка на онлайн система за поръчки, резервации,
            управление на потребители, каталог, електронна търговия, то тогава
            цената може да варира от {formatPrice(100)} до {formatPrice(2000)}{" "}
            или повече.
          </p>
          <p>
            Ако решите да работите с мен, ще Ви осигуря безплатен хостинг за
            сайта Ви на компанията Vercel. Това означава, че няма да се налага да
            плащате за място, където да съхранявате файловете на сайта.
            Единственото нещо, което ще трябва да платите, е домейнът за сайта,
            който важи за една година. Така ще спестите пари и ще имате всичко,
            което Ви трябва, без да се притеснявате за допълнителни разходи.
          </p>
          <p>
            Не е нужно да плащате всеки месец за поддръжка на сайта. Ще плащате
            само, ако решите да правим някакви промени или обновления по сайта.
            Така не се натоварвате с излишни разходи, а ще платите малка такса
            само когато имате нужда от нещо конкретно.
          </p>
          <p>
            Ако не искате сайтът Ви да бъде хостван на Vercel, можете да
            изберете някой от местните хостинг доставчици в България, за което
            аз ще Ви помогна. Не е нужно да разбирате от технологии или да се
            притеснявате как да качите сайта си – аз ще се погрижа за всичко
            това вместо Вас.
          </p>
          <p>
            Можете да посетите страницата за цени, в която можете да разгледате
            определени услуги и техните цени.
          </p>
          <PageLinkIcon
            icon="DollarSign"
            text="Цени на услуги"
            link="/prices"
            className="max-md:mx-auto"
          />
        </div>
      </div>
    </section>
  );
}
