import PageHeading from "@/app/_components/page-heading";
import Image from "next/image";

export default function TechStack() {
  return (
    <section className="bg-white space-y-10 py-10">
      <PageHeading text="Технически решения" tag="h2" />
      <div className="container mx-auto md:px-10 grid lg:grid-cols-2 items-center gap-10 max-lg:grid-reverse">
        <div className="text-lg text-left max-lg:text-center py-10 px-5 md:p-0 space-y-5 max-lg:order-2">
          <p>
            В зависимост от хостинга, размера и сложността на сайта, ще изберем
            заедно най-подходящата за Вас технология – PHP или JavaScript. Така
            сайтът ще работи оптимално и без излишни натоварвания.
          </p>
          <p>
            Използвам надежден и изчистен код, за да осигуря бързина, сигурност
            и лесна поддръжка. Всичко е съобразено с конкретните нужди на
            проекта, без ненужни добавки, които да го забавят или усложняват.
          </p>
          <p>
            Ако имате конкретни предпочитания или въпроси за технологията, ще Ви
            обясня възможностите, за да вземете информирано решение.
          </p>
          <p>
            Всеки уеб сайт има SSL сертификат, който да осигури защита с
            криптиране на данните, който се изпращат от клиента до сървъра на
            сайта Ви. Това помага на търсещите машини като Google да показват
            сайта на по-предни позиции в резултатите от търсенето.
          </p>
          <p>
            Gzip е техника за компресиране на файлове, която прави сайта
            по-бърз. Тя намалява размера на текстовите файлове (като HTML, CSS и
            JavaScript), които се зареждат на сайта, което означава, че те се
            изпращат по-бързо от сървъра до браузъра на потребителя. Това
            подобрява скоростта на зареждане на сайта и намалява натоварването
            на сървъра, което води до по-добро потребителско изживяване и помага
            на SEO оптимизацията.
          </p>
          <p>
            Редовното създаване на резервни копия на данни и конфигурации е от
            съществено значение за възстановяване на сайта след инциденти като
            атаки или сривове.
          </p>
        </div>
        <Image
          src={"/images/tech-stack.png"}
          alt="Технически решения"
          width={900}
          height={600}
          priority
          className="w-full max-lg:order-1 mx-auto lg:ml-auto max-lg:max-w-xs object-cover"
        />
      </div>
    </section>
  );
}
