import Image from "next/image";

import PageHeading from "@/app/_components/page-heading";

export default function PriceSection() {
  return (
    <section id="price" className="bg-white">
      <PageHeading tag="h2" text="Каква е цената?" />
      <div className="container mx-auto py-5 md:py-10 grid lg:grid-cols-2 items-center gap-5 px-5">
        <div className="text-lg space-y-5 max-md:order-2 max-lg:text-center">
          <p>
            Цената за изработка на фирмен уеб сайт зависи от няколко основни
            фактора. На първо място, тя се определя от сложността и обхвата на
            проекта – дали сайтът ще бъде базов тип 'визитка' с няколко страници
            (Начало, За нас, Контакти и др.), или ще включва допълнителни
            функционалности като онлайн каталог, блог, система за запитвания,
            многоезичност или дори интеграция с външни платформи. Също така,
            дизайнът играе важна роля – индивидуално разработен дизайн спрямо
            бранда на компанията изисква повече време и ресурси, отколкото
            използването на готов шаблон.
          </p>
          <p>
            Обичайно ценовият диапазон за изработка на стандартен фирмен уеб
            сайт за малки и средни компании започва от
            <strong className="font-semibold"> 800 до 2500 лв.</strong>
            За по-сложни проекти, които изискват допълнителни разработки,
            персонализирани модули или интеграции, цената може да варира между 3
            000 и 10 000 лв., в зависимост от изискванията и функциите, които
            клиентът желае да бъдат включени. В тези случаи обикновено
            предлагаме детайлна консултация и изготвяме индивидуална оферта,
            съобразена с нуждите и бюджета на конкретната фирма.
          </p>
          <p>
            Важно е да отбележим, че винаги{" "}
            <strong>има възможност за редуциране на крайната цена</strong>. Ако
            проектът се раздели на етапи или ако се използват вече разработени
            решения, можем да предложим по-достъпна алтернатива, без това да
            влияе на качеството на крайния продукт.
          </p>
          <p>
            Вярвам, че всяка успешна колаборация започва с открит диалог и
            гъвкавост. Затова при мен цените подлежат на договаряне в зависимост
            от мащаба на проекта и възможностите на клиента. Ако имате конкретна
            идея или изисквания, свържете се с мен за безплатна консултация и ще
            Ви предоставим най-подходящото ценово предложение.
          </p>
        </div>
        <Image
          src={"/illustrations/price-and-budget.svg"}
          alt="Изработка на сайт за обяви - Каква е цената?"
          width={600}
          height={400}
          loading="lazy"
          className="mx-auto max-md:order-1"
        />
      </div>
    </section>
  );
}
